# coding:utf-8

POUETRIES = [
"""春夜洛城闻笛
[唐]李白

谁家玉笛暗飞声，散入春风满洛城。
此夜曲中闻折柳，何人不起故园情。
""",

"""蝶恋花·春景
[宋]苏轼

花褪残红青杏小。
燕子飞时，绿水人家绕。
枝上柳绵吹又少。天涯何处无芳草！

墙里秋千墙外道。
墙外行人，墙里佳人笑。
笑渐不闻声渐悄。多情却被无情恼。
""",

"""秋柳
[清]王士祯

秋来何处最销魂？残照西风白下门。
他日差池春燕影，只今憔悴晚烟痕。
愁生陌上黄聪曲，梦远江南乌夜村。
莫听临风三弄笛，玉关哀怨总难论。
""",

"""锦瑟
[唐]李商隐

锦瑟无端五十弦，一弦一柱思华年。
庄生晓梦迷蝴蝶，望帝春心托杜鹃。
沧海月明珠有泪，蓝田日暖玉生烟。
此情可待成追忆，只是当时已惘然。
""",

"""登幽州台歌
[唐]陈子昂

前不见古人，后不见来者。
念天地之悠悠，独怆然而涕下。
""",

"""生查子·元夕
[宋]欧阳修

去年元夜时，花市灯如昼。
月上柳梢头，人约黄昏后。
今年元夜时，月与灯依旧。
不见去年人，泪湿春衫袖。
""",

"""青玉案·元夕
[宋]辛弃疾

东风夜放花千树，更吹落，星如雨。
宝马雕车香满路，凤箫声动，玉壶光转，一夜鱼龙舞。

蛾儿雪柳黄金缕，笑语盈盈暗香去。
众里寻他千百度，蓦然回首，那人却在，灯火阑珊处。
""",

"""望岳
[唐]杜甫

岱宗夫如何？齐鲁青未了。
造化钟神秀，阴阳割昏晓。
荡胸生曾云，决眦入归鸟。
会当凌绝顶，一览众山小。
""",

"""送元二使安西
[唐]王维

渭城朝雨浥轻尘，客舍青青柳色新。
劝君更尽一杯酒，西出阳关无故人。
""",

"""别董大
[唐]高适

千里黄云白日曛，北风吹雁雪纷纷。
莫愁前路无知己，天下谁人不识君。
""",

"""出塞
[唐]王之涣

黄河远上白云间，一片孤城万仞山。
羌笛何须怨杨柳，春风不度玉门关。
""",

"""黄鹤楼送孟浩然之广陵
[唐]李白

故人西辞黄鹤楼，烟花三月下扬州。
孤帆远影碧空尽，唯见长江天际流。
"""
]